# Завдання 1
def song(x, y, z):
    """
    Функція яка приймає три цілі невід'ємні числа x, y, z
    та повертає рядок "Ewerbody sing a song: текст пісні."
    де текст формується з y куплетів розділених пробілами всі куплети однакові і складаються з x "la"
    через дефіс 
    якщо z = 1 то в кінці куплету додається "!"
    якщо z = 0 то в кінці куплету додається "."
    за відсутності куплетів пробіл перед крапкою окличним знаком не ставиться
    """
    
    if x <= 0 or y < 0 or (z != 0 and z != 1):   # Перевіряємо чи числа не від'ємні і не нульові
        print ("Невірні числа")
        return ''
    
    if y == 0:   # Якщо немає куплетів
        return f"Everybody sing a song:{'!' if z == 1 else '.'}"

    string = '-'.join(['la'] * x)  # Формуємо рядок з куплетами
    song = ' '.join([string] * y)  # Формуємо рядок з куплетами
    return f"Everybody sing a song: {song}{'!' if z == 1 else '.'}"  # Повертаємо рядок з піснею

# Завдання 2
def luc_tickets(num_1, num_2):
    """
    Функція яка приймає два цілі невід'ємні числа num_1, num_2
    та повертає кількість счастливих квитків в діапазоні від num_1 до num_2
    Якщо число на проміжку має меньше 6 цифр то на його початку дописуються нулі
    """
    
    count = 0  # Лічильник щасливих квитків
    
    for num in range(num_1, num_2 + 1):
        # Перевіряємо чи число має 6 цифр
        if len(str(num)) < 6:
            num = str(num).zfill(6)  # Додаємо нулі на початку числа
        else:
            num = str(num)
        # Перевіряємо чи число щасливе
        if sum(map(int, num[:3])) == sum(map(int, num[3:])):
            count += 1  # Збільшуємо лічильник щасливих квитків
    return count  # Повертаємо кількість щасливих квитків
    
    