from func_modul import *

def main():
    """Основна функція яка викликає інші функції з модуля\n
    func_modul та виводить результат їх роботи"""
    
    main_menu = { # Список головного меню
        1: "Створити новий файл .csv",
        2: "Додати студента до списку",
        3: "Вивести вміст файлу",
        4: "Знайти студента за прізвищем",
        5: "Знайти студента за номером у списку",
        6: "Відредагувати данні про студента",
        7: "Сортувати список студентів",
        8: "Видалити студента зі списку",
        9: "Вихід"
    }
    
    while True:
        print("\nВас вітає програма для роботи з файлами .csv\n"
            "В цій програмій ви можете обрати одну з наступних дій\n"
            "які в свою чергу виконають обрану функцію\n")
        
        for key, value in main_menu.items():
            print(f"{key}: {value}")
        
        menu = (input("\nОберіть функцію: "))
        
        # Валідація введення
        if not menu.isdigit(): # перевірка чи введене число
            print("Номер повинен бути числом від 1 до 10"
                " Продовжити роботу з програмою? (Введіть n для завершення або Enter для продовження)")
            if input() == "n":
                print("До побачення!")
                break
            else:
                continue 
    
        menu = int(menu) # перетворення введеного значення в число
        
        # Валідація введення
        if menu not in main_menu:
            print("Не вірний номер функції виберіть від 1 до 8"
                  " Продовжити роботу з програмою? (Введіть n для завершення або Enter для продовження)")
            if input() == "n":
                print("До побачення!")
                break
            else:
                continue 
            
        # Виклики функцій
        if menu == 1: 
            new_file()
        
        # Запит на продовження роботи з програмою
            print("Продовжити роботу з програмою? (Введіть n для завершення або Enter для продовження)")
            if input() == "n":
                print("До побачення!")
                break
            else:
                continue
        
        elif menu == 2:
            add_student()        
        
        # Запит на продовження роботи з програмою
            print("Продовжити роботу з програмою? (Введіть n для завершення або Enter для продовження)")
            if input() == "n":
                print("До побачення!")
                break
            else:
                continue 
        
        elif menu == 3:
            read_file()
            
        # Запит на продовження роботи з програмою
            print("Продовжити роботу з програмою? (Введіть n для завершення або Enter для продовження)")
            if input() == "n":
                print("До побачення!")
                break
            else:
                continue 
            
        elif menu == 4:
            search_student_name()
        
        # Запит на продовження роботи з програмою
            print("Продовжити роботу з програмою? (Введіть n для завершення або Enter для продовження)")
            if input() == "n":
                print("До побачення!")
                break
            else:
                continue 
        
        elif menu == 5:
            search_student_num()
            
        # Запит на продовження роботи з програмою
            print("Продовжити роботу з програмою? (Введіть n для завершення або Enter для продовження)")
            if input() == "n":
                print("До побачення!")
                break
            else:
                continue   
            
        elif menu == 6:
            editing_student()
            
        # Запит на продовження роботи з програмою
            print("Продовжити роботу з програмою? (Введіть n для завершення або Enter для продовження)")
            if input() == "n":
                print("До побачення!")
                break
            else:
                continue
            
        elif menu == 7:
            sort_average()
        
        # Запит на продовження роботи з програмою
            print("Продовжити роботу з програмою? (Введіть n для завершення або Enter для продовження)")
            if input() == "n":
                print("До побачення!")
                break
            else:
                continue
        
        elif menu == 8:
            remove_student()
        
        # Запит на продовження роботи з програмою
            print("Продовжити роботу з програмою? (Введіть n для завершення або Enter для продовження)")
            if input() == "n":
                print("До побачення!")
                break
            else:
                continue 
               
        elif menu == 9:
            print("Вихід з програми")
            break
        
        break
    
if __name__ == "__main__": # Перевірка чи файл був запущений напряму
    main() # Виклик основної функції