def ask_month (nam_month): # Функція яка приймає номер місяця і виводить його назву
    """Функція яка приймає як аргумент номер місяця і виводить його нзву\n
    на екран та нічого не повертає.
    
    Parameters:
    month_number (int): Номер місяця (1-12)
    """
    month = { # словник з назвами місяців
         1: "Січень",
         2: "Лютий",
         3: "Березень", 
         4: "Квітень", 
         5: "Травень",
         6: "Червень", 
         7: "Липень",
         8: "Серпень",
         9: "Вересень",
         10: "Жовтень",
         11: "Листопад",
         12: "Грудень"
    }
    if nam_month in month: # перевірка чи існує такий місяць
        print(month[nam_month]) # виведення назви місяця
    else: # якщо такого місяця не існує
        print("Такого місяця не існує") 
        
   