def ask_mans(n):
    """Функція, яка приймає номер місяця і виводить пору року"""
    if n == 12 or n == 1 or n == 2: # 12, 1, 2 - зима
        print("Зима")
    elif 3 <= n <= 5: # 3, 4, 5 - весна
        print("Весна")
    elif 6 <= n <= 8: # 6, 7, 8 - літо
        print("Літо")
    elif 9 <= n <= 11: # 9, 10, 11 - осінь
        print("Осінь")
    else:
        print("Такого місяця не існує") # якщо введено невірне значення
       
n = int(input("Введіть номер місяця: ")) # введення номера місяця
ask_mans(n) # виклик функції
 