from func_modul import * # Імпорт функції з іншого файлу

def main():
    """Основна функція яка викликає інші функції з модуля\n
    func_modul та виводить результат їх роботи"""
    
    main_menu = { # Список головного меню
        1: "Визначення пори року за номером місяця",
        2: "Перевірка року на високосність",
        3: "Перевірка коректності введення дати",
        4: "Визначення повторюваних дат",
        5: "Випадкова дата у форматі dd.mm.yyyy",
        6: "Порівняння двох дат, різниця в днях та роках між ними",
        7: "Визначення місяця за номером",
        8: "Вихід"
    }
    
    while True:
        # Привітання та виведення меню
        print("\nВас вітає програма для роботи з датами та місяцями\n" 
            "В цій програмій ви можете обрати одну з наступних дій\n"
            "які в свою чергу виконають обрану функцію\n")
        for key, value in main_menu.items(): # Виведення меню
            print(f"{key}: {value}") 
        
        # Вибір функції
        menu = (input("\nОберіть функцію: ")) # Вибір дії 

        # Валідація введення
        if not menu.isdigit(): # перевірка чи введене число
            print("Номер повинен бути числом від 1 до 8"
                " Продовжити роботу з програмою? (Введіть n для завершення або Enter для продовження)")
            if input() == "n":
                print("До побачення!")
                break
            else:
                continue 
    
        menu = int(menu) # перетворення введеного значення в число
        
        # Валідація введення
        if menu not in main_menu:
            print("Не вірний номер функції виберіть від 1 до 8"
                  " Продовжити роботу з програмою? (Введіть n для завершення або Enter для продовження)")
            if input() == "n":
                print("До побачення!")
                break
            else:
                continue 
            
        # Виклики функцій
        
        if menu == 1: 
            n = int(input("Введіть номер місяця: ")) # введення номера місяця
            ask_mans(n) # виклик функції
            
            # Запит на продовження роботи з програмою
            print("Продовжити роботу з програмою? (Введіть n для завершення або Enter для продовження)")
            if input() == "n":
                print("До побачення!")
                break
            else:
                continue
        
        elif menu == 2:
            year = int(input("Введіть рік: ")) # введення року
            ask_year(year) # виклик функції
            
            if ask_year(year): # перевірка чи рік високосний
                print("Рік високосний") # виведення результату
            else:
                print("Рік не високосний") # виведення результату 
                
            # Запит на продовження роботи з програмою       
            print("Продовжити роботу з програмою? (Введіть n для завершення або Enter для продовження)")
            if input() == "n":
                print("До побачення!")
                break
            else:
                continue
        
        elif menu == 3:
            day = int(input("Введіть день: ")) # введення дня
            month = int(input("Введіть місяць: ")) # введення місяця
            year = int(input("Введіть рік: ")) # введення року

            if date_correct(day, month, year): # виклик функції
                print(f"{day:02d}.{month:02d}.{year} - коректна дата") # виведення результату
            else:
                print(f"{day:02d}.{month:02d}.{year} - некоректна дата") # виведення результату
            
            # Запит на продовження роботи з програмою       
            print("Продовжити роботу з програмою? (Введіть n для завершення або Enter для продовження)")
            if input() == "n":
                print("До побачення!")
                break
            else:
                continue
        
        elif menu == 4:
            list_date = [] # створюємо пустий список для дат
            
            # Запит на вибір методу введення дат
            func_metod = {
                1: "Введення дат з клавіатури",
                2: "Випадкові дати"
            }
            
            print("Меню функції:")
            for key, value in func_metod.items():# виведення меню
                print(f"{key}. {value}")

            input_method = (input("\nВиберіть пункт меню: "))

            if not input_method.isdigit(): # перевірка чи введене число
                print("Номер повинен бути числом від 1 до 2")
                return
            
            if input_method == "1":
                while True: # цикл для введення дат
                    date_inupt = input("Введіть дати у форматі dd.mm.yyyy (натисніть Enter\nз пустим полем для завершення): ") # введення дат
    
                    if date_inupt == "": # якщо натиснуто Enter
                        break # вихід з циклу
    
                    list_date.append(date_inupt) # додавання дати в список
            
            elif input_method == "2":
                num_dates = int(input("Введіть кількість дат для генерації: "))
                for _ in range(num_dates):
                    list_date.append(random_data())
             
            print("\nСписок дат:")
            for date in list_date: # виведення списку дат
                print(date) 
                        
            duplicate_dates = search_date(list_date) # отримуємо словник повторюваних дат
        
            if duplicate_dates: # якщо є повторювані дати
                if "Немає однакових дат" in duplicate_dates:
                    print("Дублікатів не знайдено\n")
                else:
                    print("Знайдені дублікати:")
                    for date, count in duplicate_dates.items():
                        print(f"Дата {date} зустрічається {count} разів")
            else:
                print("Дублікатів не знайдено\n") 
            print()
        
            # Запит на продовження роботи з програмою       
            print("Продовжити роботу з програмою? (Введіть n для завершення або Enter для продовження)")
            if input() == "n":
                print("До побачення!")
                break
            else:
                continue  
            
        elif menu == 5:
            while True: # цикл для введення дат
                data = str(input("Нажміть Enter для виведення випадкової дати: "))
                if data == "": # якщо натиснуто Enter
                    print(random_data()) # виклик функції
            
                # Запит на продовження роботи з програмою       
                print("Продовжити роботу з програмою? (Введіть n для завершення або Enter для продовження)")
                if input() == "n":
                    print("До побачення!")
                    break
                else:
                    continue   
                
        elif menu == 6:
            date1 = str(input("Введіть першу(більшу) дату у форматі dd.mm.yyyy: ")) # введення першої дати
            date2 = str(input("Введіть другу(меншу) дату у форматі dd.mm.yyyy: ")) # введення другої дати       

            days, years = dates(date1, date2) # виклик функції
            if days >= 0: # перевірка чи друга дата менша за першу
                print(f"Різниця між датами: {date1} та {date2} : {days} днів та {years} років") # виведення результату
            else:
                print("Перша дата повинна бути меншою за другу") # виведення результату 
                
            # Запит на продовження роботи з програмою       
            print("Продовжити роботу з програмою? (Введіть n для завершення або Enter для продовження)")
            if input() == "n":
                print("До побачення!")
                break
            else:
                continue
            
        elif menu == 7:
            nam_month = input("Введіть номер місяця: ") # введення номера місяця
            
            if not nam_month.isdigit():
                print("Номер місяця повинен бути числом")
            else:
                nam_month = int(nam_month)
                ask_month(nam_month) # виклик функції
            
            # Запит на продовження роботи з програмою       
            print("Продовжити роботу з програмою? (Введіть n для завершення або Enter для продовження)")
            if input() == "n":
                print("До побачення!")
                break
            else:
                continue
        
        elif menu == 8:
            print("Вихід з програми")
            break
        
        break
    
if __name__ == "__main__": # Перевірка чи файл був запущений напряму
    main() # Виклик основної функції
    

