def ask_year(year):
    """Функція яка приймає рік і виводить True якщо він високосний та Folse якщо ні"""
    if year % 4 == 0 and year % 100 != 0 or year % 400 == 0: # перевірка чи рік високосний
        return True # якщо високосний
    else:
        return False # якщо не високосний

year = int(input("Введіть рік: ")) # введення року
ask_year(year) # виклик функції
if ask_year(year): # перевірка чи рік високосний
    print("Рік високосний") # виведення результату
else:
    print("Рік не високосний") # виведення результату
    
