import random as rd

# Списки слів задані через словник words з трьома ключами
words = {
    "list1": [
        "Швидкий", "Розумний", "Винахідливий", "Новачок", "Досвідчений", "Ефективний", "Креативний", 
        "Інноваційний", "Сучасний", "Професійний", "Надійний", "Підготовлений", "Аналітичний", "Постійний", 
        "Гнучкий", "Системний", "Прагматичний", "Модерний", "Адаптивний", "Талановитий", "Досліджений"
    ],
    "list2": [
        "програміст", "кодер", "розробник", "хакер", "тестувальник", "системний адміністратор", "аналітик", 
        "дизайнер", "архітектор", "фронтенд-розробник", "бекенд-розробник", "фулстек-розробник", "DevOps", 
        "проектний менеджер", "інженер", "адміністратор баз даних", "спеціаліст з безпеки", "UI/UX дизайнер", 
        "інженер з якості", "підтримка", "графічний дизайнер", "інтерфейсний дизайнер"
    ],
    "list3": [
        "пише код", "налагоджує баги", "створює додатки", "оптимізує алгоритми", "вивчає Python", "створює сайти", 
        "розробляє API", "створює мобільні додатки", "впроваджує інтерфейси", "пишуть скрипти", "налаштовує сервери", 
        "проектує бази даних", "розробляє інфраструктуру", "забезпечує безпеку", "проводить тестування", "створює чат-ботів", 
        "проводить дебагінг", "оптимізує швидкодію", "налаштовує контейнеризацію", "створює блокчейн-розв'язки", 
        "аналізує дані", "розробляє ігри", "створює віртуальні машини", "проводить аудит"
    ]
}

def generate_phrase(words): # Функція для генерації випадкової фрази

    word1 = rd.choice(words["list1"]) # Випадкове слово з першого списку
    word2 = rd.choice(words["list2"]) # Випадкове слово з другого списку
    word3 = rd.choice(words["list3"]) # Випадкове слово з третього списку
    
    phrase = f"{word1} {word2} {word3}." # Формуємо фразу з трьох випадкових слів
    return phrase

while True: # Цикл для генерації нових фраз
    print("======================")
    print(f"Випадкова фраза: {generate_phrase(words)}") # Виводимо результат
    
    # Запит на продовження роботи з програмою
    print("Продовжити роботу з програмою? (Введіть n для завершення або Enter для продовження)")
    if input() != "":
        print("Завершення програми!")
        break
    else:
        continue
    
